package chapter02;

import java.util.ArrayList;
import java.util.Scanner;

public class ArraylistQQQwork {             //二维数组与数组列表的应用DEMO

	public static void main(String[] args) {
		String[][] seats = { { "220431601", "马飞儿", "大类6班", "13" }, { "220431603", "马智博", "大类6班", "8" },  //定义同学二维数组
				{ "220431604", "牛压文", "大类6班", "5" }, { "220431605", "王云鹏", "大类6班", "15" },
				{ "220431606", "王泽恺", "大类6班", "3" }, { "220431607", "韦朗", "大类6班", "52" },
				{ "220431608", "左烨琦", "大类6班", "36" }, { "220431610", "刘明乐", "大类6班", "6" },
				{ "220431612", "宋枫娇", "大类6班", "32" }, { "220431613", "李欣蕊", "大类6班", "12" },
				{ "220431615", "李恩鱼", "大类6班", "10" }, { "220431616", "李晓菲", "大类6班", "21" },
				{ "220431617", "李晨晨", "大类6班", "14" }, { "220431618", "周江海", "大类6班", "7" },
				{ "220431619", "周莉金", "大类6班", "9" }, { "220431620", "孟竹涵", "大类6班", "19" },
				{ "220431621", "孟晶", "大类6班", "38" }, { "220431624", "罗明凤", "大类6班", "20" },
				{ "220431625", "侯垚", "大类6班", "11" }, { "220431626", "侯嘉怡", "大类6班", "54" },
				{ "220431627", "崔维冲", "大类6班", "25" }, { "220431628", "曾永心", "大类6班", "31" },
				{ "220431631", "蔡怡君", "大类6班", "17" }, { "220431632", "薛志慧", "大类6班", "35" },
				{ "220431633", "张晓涛", "大类6班", "4" }, { "220431634", "张栖", "大类6班", "18" },
				{ "220431636", "韩雪", "大类6班", "30" }, { "220431637", "石海蛟", "大类6班", "28" },
				{ "220431638", "尹剑雄", "大类6班", "27" }, { "200303310", "温晨阳", "大类6班", "29" },
				{ "220801211", "何恬", "大类6班", "55" }, { "200106415", "刘小冬", "大类6班", "26" },
				{ "220431501", "马卓", "大类5班", "61" }, { "220431502", "孔丹栋", "大类5班", "53" },
				{ "220431503", "户玺文", "大类5班", "59" }, { "220431505", "王晓娟", "大类5班", "43" },
				{ "220431506", "王婷", "大类5班", "79" }, { "220431507", "史晓蓉", "大类5班", "45" },
				{ "220431508", "宁世雄", "大类5班", "79" }, { "220431509", "田桂献", "大类5班", "69" },
				{ "220431510", "白海龙", "大类5班", "50" }, { "220431511", "白贺强", "大类5班", "2" },
				{ "220431512", "刘晓蔚", "大类5班", "49" }, { "220431513", "米改妮", "大类5班", "78" },
				{ "220431514", "何奇昌", "大类5班", "58" }, { "220431516", "李佩", "大类5班", "68" },
				{ "220431517", "李嘉婧", "大类5班", "42" }, { "220431518", "周田伟", "大类5班", "51" },
				{ "220431519", "周诗凯", "大类5班", "73" }, { "220431520", "芦志鹏", "大类5班", "60" },
				{ "220431521", "高元昊", "大类5班", "70" }, { "220431522", "陶秀丽", "大类5班", "48" },
				{ "220431523", "黄文静", "大类5班", "47" }, { "220431525", "裴文涛", "大类5班", "67" },
				{ "220431527", "张彤", "大类5班", "76" }, { "220431528", "张姣姣", "大类5班", "66" },
				{ "220431529", "张楠", "大类5班", "57" }, { "220431530", "杨子萱", "大类5班", "77" },
				{ "220431531", "杨超群", "大类5班", "72" }, { "220431533", "赵娜", "大类5班", "74" },
				{ "220431534", "陈润凯", "大类5班", "71" }, { "220431535", "韩玲玉", "大类5班", "44" },
				{ "220431536", "颉瑞利", "大类5班", "75" } };
		System.out.println("一共有" + seats.length + "名学生");
		Scanner in = new Scanner(System.in);
		ArrayList<String> names = new ArrayList<String>(); // 定义一个数组列表 名为names
		for (int i = 0; i < seats.length; i++) { // 通过for循环来将二维数组中的数据输入到数组列表中去
			names.add(seats[i][1]); // 在数组中 1 ---->为学生的姓名
		}
		System.out.print("请输入要查询的学生姓名："); //通过用户输入学生姓名查询
		String name = in.next();
		String seat = "您输入的有误！查无此人！";     //定义seat 用于判断/输出
		for (int i = 0; i < seats.length; i++) {   //利用循环将座位号赋值给seat
			if (seats[i][1].equals(name)) {
				seat = seats[i][3];
				break;  //当 用户键入的姓名和数组中一致，将seat赋值 并且break停止循环
			}
		}
		if(seat=="您输入的有误！查无此人！")      //利用if语句处理异常
		{
			System.out.println("您输入的有误！查无此人！");
		}
		else{
			System.out.println(name + "的座位号是" + seat+"号");  //将结果输出
		}
	}
}
